In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv('scores.csv', index_col=0)
#index_col을 지정하여 0으로

In [5]:
df

     국어  영어   수학   합계
김연아  70  76   60  206
최동원  80  87   79  246
박병호  58  59  100  217
허재   69  70   45  184
이만기  70  72   78  220
오승환  40  45   98  183

In [20]:
df.to_json("C:/Users/KimSeungHwan/수업!/데이터과학/Pandas/scores.json")
# 판다스 파일을 다른 파일로 변환

In [17]:
dfj = pd.read_json('scores.json')

In [21]:
df.to_html("C:/Users/KimSeungHwan/수업!/데이터과학/Pandas/scores.html")

In [24]:
df_html=pd.read_html("scores.html", index_col=0, encoding='utf-8')

In [28]:
type(df_html)

list

In [29]:
df_html[0]

     국어  영어   수학   합계
김연아  70  76   60  206
최동원  80  87   79  246
박병호  58  59  100  217
허재   69  70   45  184
이만기  70  72   78  220
오승환  40  45   98  183

In [30]:
df_html2=df_html[0]

In [31]:
df_html2

     국어  영어   수학   합계
김연아  70  76   60  206
최동원  80  87   79  246
박병호  58  59  100  217
허재   69  70   45  184
이만기  70  72   78  220
오승환  40  45   98  183

In [32]:
import sqlite3
con =sqlite3.connect("test.db")

In [36]:
dbdf = pd.read_sql("SELECT * FROM scores", con, index_col='이름')

In [37]:
dbdf

     국어  영어  수학
이름
철수   84  87  78
영이   21  15  84
길동   87  84  76
미영  100  85  99
순이   58  67  66
철이   46  77  56